#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "b7308d98182571da8b70656e0c2673d9" -> "7fc8ad739511066620dfa2f5ec26e619"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "4e6fac809ea28493c2622723d7bff66d" -> "9b6006a8ba3ccbdc892d2aca161cef77"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "08c50f477a806a24267c853bf78805d5" -> "44ba2ef440061f73d86e1dccd61eb589"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "e8cedad381af154b1a5c74d1d0112243" -> "6bcc0a5a77235ba913db80092a6a1536"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "3bbd55db1e6ba4bd16f4b9aa15701149" -> "a757abb361fa4b8d47916d17abd80459"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "aa3db18417da16031b3d286d082fd00c" -> "9e785881413416a102e6348abd2dae9a"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "aa361f11cb99efc7bbfe71eb07b94d1d" -> "f56f2454821e2aac0f13db257e0e8943"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "8a427770bb13c569e9263cb4cfb561c0" -> "63dbdea797fb6f9efd1d768200ff8e81"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "c746c8ba371bcd284817e8c555e23e2f" -> "60f346a2178315baa6cc0cd749b2fe91"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "2111723bf19c0a9b0a2af829ca5b46dd" -> "bf26cdec636f6c244f52b773db0b52ce"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "ec14616d9f7c8878474b7a6f325c4fce" -> "5f53a02452e0a0e829402fe87ee521f2"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "f689e89f9ebc884e7bc207da284cf14b" -> "bd4761d1cace67d9d230f18f89a94ca8"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "34d91ef0e618820b7e811d01239a611f" -> "c2c2932444bc22471c350634b2e5c767"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "3cfbd69a828fb2d2354eed51af28ed28" -> "eb6920a1a2eaab89567c0e58c7a53619"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "6e878663eecc94758e718e080583a199" -> "9fd8831d222f02a989b7d0c077b844ea"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "005857587cfbea061e206d830013dd5b" -> "a5366f88d24350cc194eb5a9d97a098c"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "ff8d0d8361db5be960cbc7bb79789039" -> "472efdc0337765627fe3b23d091700e7"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "fabe9ba8dcc44229ace9325978bffef9" -> "aebf5edee639adc41c6d33864bd594b5"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "187c4f386d6ef74c49b9da65c49efc63" -> "9969987629e642fa08dc0941cd0381d7"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "8f9f3e0fdf603b6cc3ce7b0ef1bf5c47" -> "bb9686ea5f8d5cffa2e49e952b8fb832"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "a5f82f1dd1c4b3db5985c630281e3c8c" -> "49fdb840dcb9b129c0a0bbc79d5b3b7e"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "8f23c53661bcaba33bab3909098a98db" -> "f0d8d125cebb355c052a5821bba55495"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "e2f1b0e8aa95cb1a7f3d373255f2e3d7" -> "7fd3f717c7a31769c4c3bea565a52874"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "c4f76b068684a5776e759452fa9b9399" -> "294b609b8045bfd1059910335d01f88b"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "f22c2b8680800cf000b722a3dcb9aeaa" -> "e7b0ee6d01a0286534bcf23845535809"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "bb3d3d96bf8631dcaf2388f642c4f997" -> "afeb24cf7d241a7fa54fd274b2dd27b2"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "dbb5b2b82e0aa6a2e02c30bf846fcc59" -> "99edc2e566d770d64d5c6bb857bc7a95"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "562e3d8094cd36caa0524d193ccdef1b" -> "448c0506d9c5f7230b74f33096d8ed94"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "99c41939f42577092e6fa2e79c4b7b14" -> "bf21277847d56316f71d291aa6d12491"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "eb55c653a29e22d8b10885eb5b4e41fd" -> "ebac56c156215c91960eb1d7bbb34130"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "e2d0cab8ba0fb9daa70bb282db5cbd9c" -> "d98861be38645e094129fd8670804164"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "941f448a1a07348d61d488b47b8a9430" -> "6d8f45795bc46dbb6fc02cf2237d402d"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "34582faa67fbec523d387e1db0533be3" -> "2b881765f7a4233d95f5e88261c72c6e"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "9ea20a186250a37199da9eb302aa4a08" -> "55576ac42b9d1e7ac724d05a89623214"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "51a723cfd6753ef365118af65500a602" -> "d9bcf7d8e16756e129c03a762b74b812"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "b163ea808d1c57db46c2dfc5cabf6423" -> "db1198dbff56100101c387fa7937da61"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "2aad33af9667ac860effc2c87f5a2fce" -> "71943902442972bea823153191593f2f"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "1063e1fca3ab791636db25c44c63a547" -> "57a07f19eaea05cbaea11e26e66c6731"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "19cd4a2b50f8ff175ce0e32d29e9d099" -> "1fa549b37c887eb266b5d0cebe18d0af"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "eca7d0e047544df245cd13930e65654f" -> "5ee3e2f5ec03437ef854d3fb66d03b9c"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "f3d9dc32b685bd00a64fa06f7e8275c2" -> "d75b6877c6f04c332d7f27e079df72ee"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "e64ab5e96ee7db3fa886b1df79a933d7" -> "a7e4dd0bfbaf1b20c51effcc96579c8d"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "4101f8d9de61b39a50a6941eac6c01fa" -> "04be76cb4e44270a3020f94d23aafbb3"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "TYWCGuVvrc9sqeVdOChAusj+QxvtjYmPUFevTe1r+Z0=" -> "P01YYFcfuMGBgzQSm5p3uCSE+kKNvwC5OA6rYj6+iGM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "mc9UOvXW1ZBVwrqJbEZzJW68TMxqT3IxAQWjuocCQvk=" -> "/YEdxItoKYhqFbH1BuDplscylv9DDukzcRuWeLfGHiE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "CszAxaBqgscVqFK/MU0X/0WiMzCvwY7SYnooYo8/cVc=" -> "Jr6KkKiHkuSV1zJdRShTt24TwvcngpG4bdokTtij6sU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "D+G6qptMpjfOUN1e9HgFIQHmjjtQtPNl0L2nwBBgfu8=" -> "nNi5oRQunvzgiWm47kJKlhKZkrLrEvx6vZI3QjdK2ZU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "XBVgUq/niQR6pfIabAfA6CZV553aZ5wjUtlBuIpjWQ8=" -> "1o17c0b6XLHD7GfLuTmzRQkJk8xjcU0CJbYPECcZW7E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "L+cILwiEQXoq/5yaDS0rHP3V3yIhAinSuQwRtQbcepE=" -> "Eg4YcwBhDSxqWHV/jdGnDTWPTiXa9QjnU4VPs7ThMK8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "EWcOBLjFKoYylkKcfdbjoIOZsFW4zQseoCK17eIwaS8=" -> "xX2xCrknu6P+fI8lxWv6/EvlwHhm//LwiPR4aaEvJJk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "HINmKrNiME0UOU3QL1ATsJRR0tryDtD9x5mYa9imzyo=" -> "+yNBR9kh8PcLvJWtq5hedHpCQ7nMVhkK09PxkjU5TvU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "9UTwXjsv1o8c8qaRfs8wcnbK+rLy3k6HvJREANU4ZHM=" -> "x6kQrTfzP59rea/avun6QcoEvmXOgZAQrE7rz/5xBZg="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "KwTdB7tMJxc4ZTXITX6s58fAdbmImMKFL5wVHwjwSyE=" -> "UjhegQjh5QskADHpUcqF82fTz11CoG6sGZClmsOcWWs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "4H0OIV43+tstOK3KaiDU7mBn8lScyQy7qs5ogDHgd/w=" -> "0od+GatLS3CN8/fRrKRvNjTxKduJLQOOor6iTt6SjrU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "or8bQsNcJycksUPl9sDL+DOFMUDaXaOXjAGtpe03Xrk=" -> "2AE4YAKzqJe7BzNoAYG/V+qmJxkgM0qHqjSVRyhxRgo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "s9gs3SCif51Eqh0ql/3yEfUjDUaUHAjirtaQf2mHdV4=" -> "YnUmvHn9t+rayCtG4UpaQFcyJrJk+NQegXqiaBIinNI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "vpG8boMfnKj3hpS5myj9H7+qrr5oIGMhZYsWOon4PQ4=" -> "Ug0FP9hMq8Zc/cELT75YG2gnaVmiH4ahl+JnmukhDpc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "dNZVbdMhx5hIg9F1QB2yItHVJBgeMDbaK0rs0EV46pY=" -> "FnpTky1EEKp85sfffEuPuqtyIL1cCKhAiOM0hY+P/Lc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "M41+EbPf+llD/JCR6XfWoxnBWhrHuJQKEEOkKc2FtmE=" -> "rr91Ol7yIhbyyIIwbf9jn7sS5n3o5bUM2NsY0o4st4g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "Y084Cvs1zvpCVnLrjSQZw2/jWaJsHi9t8+UIvn+CSZ4=" -> "s3ZFMK+VJiRLf/4tbWXHlrXMGd9sOyFoz5B60ZjtenM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bz+PijrGOcUy7Zk2aH9+XUXOLT4e+byeiBMPr3YluOM=" -> "yOQ32+sitk03vujeRkvM9kQLMXyhxNJaM8Pn+JOFb/Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "7GqROsvbBG4mUfeRsIzWWRd3hGpJvSV6PrsiQhMYQIY=" -> "411lBB8oeyjcX/Vaps9SKks1Bl1RG6ZgjADB8/8S71I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "wdDOVhqYMhXANS+jUYbxz+ZaXC74g1VbnNXQSHWcuAI=" -> "IzFwr1/prk17D7rw22hSui0cCb8VQUno5ouXUFhqSuU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "AUejKNI2/ihuurNJLpE49SAdgspl/5HBOfUcR8g8Q3o=" -> "AG76hTAxBieF/8j9FPzteHw/gmGwvhrhylwqaQ00wLA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "eWQC+eBHBpaz8F5/GcsAWgyW5dwJx67FhC7sEcJDGpA=" -> "YbqX9VsknUhbzxxqCHYUKJZbSvL9PuxMIG8D/GvEH6E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "2DZH6P4M8RDrWw4kylp8hPfQa9vsjoMlPgJoGBYdsq0=" -> "sFbMgWkpx2bdH8aVcxakQtN0XIDQpbjxi2e8UHSwlJM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "ewejkk0K+uWbtHCxMcaVJh0GerjXvuR2jaU+8NBsHBI=" -> "CS0zSCalgT3bFawX13/dAkZc/VNv64tmRwwGnc9EItU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "yS/mjcGm68bYBSMCAX02dEJ08HC8H29mP7VjiyDJhVk=" -> "wMuRlV0955DqXxjTyboE2199Z0+2YLaDRTqyE7DH25A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-11-07T14:44:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "e0WtX04/HPlS36ARsjFVgxOhKu8EeBRlDQKYuw/BcTg=" -> "IaViUxXZhvhC8ua5XZKPp6RgSpyxmRLyuOGpee4t0AY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "MSvkpsJGnH81xgzfEJxj9tqtwr9UagwenB2qrKyIx0Y=" -> "Ko2S/VHi/KYVjqW9+uUgBwIgg1HP1lEnE9sOKSpEINw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "XUJeCWPsfBKEqf6y3qeIn8haVkVFRO0lo5VOw6MPX+0=" -> "NtZDmkajNXi2/V1bEmELwME+yPW3ctciODPV9+iTwRA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "+hr8DxnHrFcMEihRXNHLrjshMdwAlJBe2fVbc+sgD7U=" -> "qCEax/rU8TV9aht9aSoE9zKiTphnMzPls1YKvDTk/5U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "6lK8m224JHD8AGzeWxIdxOb0UyYoK7ThFUz45d0yPWs=" -> "LZWGAPFTJSzfR6xOWro/UOSqhstrdrtqW+Tf59zEhlI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "X8zdqdpRUFYe2DO4DDuvWRHCjtu0RAPmKiS/Bls89NA=" -> "MeKTEtorITIWXKdbhjsdSHcFY0rkcNaovm5ZFVsQsZs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "jjMZb1tMUaa+Zp9iDqa5QbhnNVR+/0kPXVtvtKuMtUM=" -> "kEGL/Q4XaU8m9oswO5n8nkhcHaqrW/v4XUEesl2NTng="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "JGDfxPGdprvspnOj0ZiTszGVGAGam8c6i1Bt7c5QLPE=" -> "7nbdIhEcuUEQTlqabc3Mi4a395c9/WUNcKFkwb2tpmI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "FRzvrRAtklzGaf4Fa6QgxoP2TFLKGdwFn4FvGnHdMfs=" -> "RS5US3h5iosTLuje6ODYdPcwG1sIF5TB4LI3kehJeow="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "BJsKb9DYy8pQhVQ6N9Jhxz0dVX8t1H76H68/ynX3iwA=" -> "JAqpBc/uBUwpX9EHcP5nVsP5BT/2SB/Vn0jGL8dtzm0="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "N3jLlKml6pQKreHUTX0kUvOcHM92/5cHg+piwUWRm2g=" -> "ZmTPYl76kbvgC9cT3yKLWsWPJ1FNzA1IWuJz+zZ193Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "1A1KL29Y5Qzewl4V84ogs+EB9NvsE8LNi7ruDKukMj4=" -> "bvZ6HumzE3vKz5tAe2tAP8bdGckIiB2+zO1z8NGvDHo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "LdUdrQFvnTR2cuP++BN9bHwdOPcwaGdVBhV8pjdPyVI=" -> "xthwaf+u0OJbJq6qJFie69RaqNvDeYGd/qaotip7feQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "zr56d2uiEuo53jo3z6Lgh8AhikL6O+QtmUU/CfbaJq0=" -> "Tvucj8op02efaf3YvHID+39cM2hVahNwsC4H90fbC4E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "TPzqoMXa0sZ+u3gDXbgyY1z5rRh4GSZP8BVxgIdVDM8=" -> "s+czElinGVcvtAy9lbaPwKgTVg6h/b5H0NQ0p4pArBs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "u7TFVOp95/vzpVOjVejVeNjzwgTlwDCQ8sm+bUOeKkE=" -> "varCC+gtlWgJtQ/AxXCBDfO7R6gQQ1NbU5BPWoqLUI0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "63ibKCKtJJMQRXc/UMO4OPG9SRV+/7WMlYuzQg/nrZE=" -> "atSJJ7rwTBmfIwqJ+iLFqAGr8aLqHb3bf0m02/7kW5I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-11-07T14:10:35Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "z3eha4" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-11-07T14:10:34Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-11-07T14:10:33Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 87 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*